In [2]:
import pandas as pd
import numpy as np

In [3]:
# Read the three files into python as dataframes

file1 = pd.read_excel('files_for_lab/excel_files/file1.xlsx')
file2 = pd.read_excel('files_for_lab/excel_files/file2.xlsx')
file3 = pd.read_excel('files_for_lab/excel_files/file3.xlsx')

In [5]:
# Show the DataFrame's shape.

print("File1: ", file1.shape)
print("File2: ", file2.shape)
print("File3: ", file3.shape)

File1:  (1071, 11)
File2:  (996, 11)
File3:  (7070, 11)

In [13]:
# Standardize header names.

cols = []

for col in file1.columns:
    cols.append(col.lower().replace(' ', '_'))
file1.columns = cols

cols = []
for col in file2.columns:
    cols.append(col.lower().replace(' ', '_'))
file2.columns = cols

cols = []
for col in file3.columns:
    cols.append(col.lower().replace(' ', '_'))
file3.columns = cols

Index(['customer', 'state', 'customer_lifetime_value', 'education', 'gender',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'total_claim_amount', 'vehicle_class'],
      dtype='object')

In [22]:
# Rearrange the columns in the dataframe as needed
# First let's compare the columns-labels of our 3 dataframes...

display(file1.head(1))
print(file1.columns == file2.columns)

display(file2.head(1))
print(file1.columns == file3.columns)

display(file3.head(1))
print(file2.columns == file3.columns)

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0,1000,1/0/00,Personal Auto,Four-Door Car,2.704934

[ True  True  True  True  True  True  True  True False False False]

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car

[ True False False  True False  True  True  True  True False False]

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.2,Two-Door Car

[ True False False  True False  True  True  True False False  True]

In [38]:
# ... then we rename column 'st' to 'state' and reorder the columns of dataframe 'file2' and 'file3'.

file1 = file1.rename(columns={'st':'state'})
file2 = file2.rename(columns={'st':'state'})

file2 = file2[ list(file1.columns) ]
file3 = file3[ list(file1.columns) ]

# Check if tables have same column order
print(file1.columns == file2.columns)
print(file1.columns == file3.columns)
print(file2.columns == file3.columns)

[ True  True  True  True  True  True  True  True  True  True  True]
[ True  True  True  True  True  True  True  True  True  True  True]
[ True  True  True  True  True  True  True  True  True  True  True]

In [51]:
# Concatenate the three dataframes

data = pd.concat([file1, file2, file3], axis=0)
data.shape

(9137, 11)

In [52]:
# Which columns are numerical?

data.select_dtypes(include=np.number).columns

Index(['income', 'monthly_premium_auto', 'total_claim_amount'], dtype='object')

In [53]:
# Which columns are categorical ?

data.select_dtypes(include=['object']).columns #.tolist()

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'number_of_open_complaints', 'policy_type', 'vehicle_class'],
      dtype='object')

In [54]:
# Perform the data cleaning operations mentioned so far in class

# Delete the column education and the number of open complaints from the dataframe.
data = data.drop(['education','number_of_open_complaints'], axis=1)

In [ ]:
# Correct the values in the column customer lifetime value.
# They are given as a percent, so multiply them by 100 and change dtype to numerical type.
col = data['customer_lifetime_value'].str.replace('%', '')

col.tail(20)
            

            
 #* 100
#pd.to_numeric(data['customer_lifetime_value'], errors='coerce')

In [82]:
# Check for duplicate rows in the data and remove if any.
data = data.drop_duplicates()

In [85]:
# Filter out the data for customers who have an income of 0 or less.
data = data[data['income'] <= 0]
data

,customer,state,gender,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,NaN,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0,94,Personal Auto,Four-Door Car,1131.464935
3,WW63253,California,M,764586.18%,0,106,Corporate Auto,SUV,529.881344
7,CF85061,Arizona,M,721610.03%,0,101,Corporate Auto,Four-Door Car,363.029680
10,SX51350,California,M,473899.20%,0,67,Personal Auto,Four-Door Car,482.400000
...,...,...,...,...,...,...,...,...,...
7059,WZ45103,California,F,5678.050167,0,76,Personal Auto,Four-Door Car,364.800000
7061,RX91025,California,M,19872.262,0,185,Personal Auto,SUV,1950.725547
7062,AC13887,California,M,4628.995325,0,67,Corporate Auto,Two-Door Car,482.400000
7067,TD14365,California,M,8163.890428,0,85,Corporate Auto,Four-Door Car,790.784983
7069,Y167826,California,M,2611.836866,0,77,Corporate Auto,Two-Door Car,369.600000